      IDENTIFICATION DIVISION.
      PROGRAM-ID. NEGATIVOS-DECIMALES.
      DATA DIVISION.  
      FILE SECTION.
      WORKING-STORAGE SECTION.
      01 NUMERO1 PIC S99V99.
      01 NUMERO2 PIC S99V99.
      01 RESULTADO PIC S99V99.
      PROCEDURE DIVISION.
      NEGATIVOS-DECIMALES.
          MOVE -12.34 TO NUMERO1.
          MOVE -12.34 TO NUMERO2.
          COMPUTE RESULTADO = NUMERO1 + NUMERO2.
          DISPLAY RESULTADO.
            STOP RUN.


