       IDENTIFICATION DIVISION.
       PROGRAM-ID. Suma.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMERO-1           PIC 9(3) VALUE 123.
       01 NUMERO-2           PIC 9(3) VALUE 456.
       01 RESULTADO          PIC 9(3) VALUE ZEROS.

       PROCEDURE DIVISION.
           COMPUTE RESULTADO = NUMERO-1 + NUMERO-2
           DISPLAY 'LA SUMA DE ' NUMERO-1 ' Y ' NUMERO-2 ' ES 'RESULTADO
           STOP RUN.
