       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABLA-DE-MULTIPLICAR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 NUMERO PIC 99.
           01 MULTIPLICADOR PIC 999.
           01 RESULTADO PIC 99999.
           01 SALIDA PIC X(5) VALUE SPACES.

       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "PARA SALIR INGRESE SALIR EN LA CONSOLA".
           DISPLAY "PARA MULTIPLICAR PULSA INTRO".
           ACCEPT SALIDA.
           IF SALIDA = "SALIR"
           THEN
               GO TO FINALIZAR
           ELSE
               PERFORM REINICIA-PROGRAMA
               PERFORM INTRODUCE-NUMERO
               PERFORM MOSTRAR-TABLA
               PERFORM INICIO
           END-IF.

       FINALIZAR.
           STOP RUN.

       REINICIA-PROGRAMA.
           MOVE 0 TO MULTIPLICADOR.

       INTRODUCE-NUMERO.
           DISPLAY "INTRODUCE UN NUMERO DEL 1 AL 99".
           ACCEPT NUMERO.

       MOSTRAR-TABLA.
           DISPLAY "TABLA DEL " NUMERO.
           PERFORM MULTIPLICAR.

       MULTIPLICAR.
           ADD 1 TO MULTIPLICADOR.
           COMPUTE RESULTADO = NUMERO * MULTIPLICADOR.
           DISPLAY NUMERO " X " MULTIPLICADOR " = " RESULTADO.
           IF MULTIPLICADOR LESS THAN 10
           THEN
               PERFORM MULTIPLICAR
           END-IF.

